import { chengPhotos } from "./chengPhotos";
import { wangPhotos } from "./wangPhotos";
import { suPhotos } from "./suPhotos";
import { kPhotos } from "./kPhotos";
import { naPhotos } from "./naPhotos";


export const friends = {
  cheng: {
    name: "cheng",

    questions: [
      {
        question: "我們最常聚餐點？",
        options: ["教室", "Ju屋處", "小米", "McDonald's"],
        answer: "小米",
      },
      {
        question: "曾經某堂課中你與Perry請我錄製一段影片,內容是什麼？",
        options: ["你們在大笑", "手勢舞", "沒有這件事", "沒錄到半點"],
        answer: "沒錄到半點",
      },
      {
        question: "我們曾經約在體育館路口面交什麼？",
        options: ["甜甜圈+雜誌", "安全帽+補習班書", "安全帽+雜誌", "司康+安全帽"],
        answer: "司康+安全帽",
      },
      {
        question: "你分享的水質混濁搖晃後清澈那部影片中女孩英文名？",
        options: ["Sandy", "Sara", "Sammy", "Sally"],
        answer: "Sara",
      },
      {
        question: "哪道早餐出現在菜單上我會叫你要點？",
        options: ["金沙魚仔", "太陽芋泥球", "100種味道", "手雞潛堡"],
        answer: "太陽芋泥球",
      },
    ],

    photos: chengPhotos,
    backgroundPhoto:
    "/images/cheng/05.JPG",
    letter: `
嗨 尹榛 ♡⁼³₌₃
從一開始認識你到現在走到最後，真的有種一層層剝開更認識的感覺，
很好笑開場白就要這麼認真就是了(̿▀̿ ̿Ĺ̯̿̿▀̿ ̿)̄
從最初覺得你是一位親切的搭檔，到漸漸變熟可以開玩笑，
也可以一起吃小米嘿嘿，慢慢地我們成為共識的夥伴，
最後成為一起笑到肚子痛一起聊未來的摯友，
哇！真的覺得時間過得好快，才覺得更靠近些卻又要說再見了。

感覺大學四年待在一起的大多數時間都有某些正事要討論，
但說真的真正令我懷念的卻是最後那唯一一次我們六個人一起出遊的短暫幾天，
我最喜歡的是第一天與你一起坐在海邊聽海浪的聲音，
吹著海風聽著我們都喜歡的歌，真的很美好！
我也把這天的美照選在回憶裡面，你剛才看照片的時候有認真看齁(◜◔。◔◝)

謝謝你那天吃飯聚會的時候特別準備的驚喜，很港動！
我們也真的要一起實現去聽廣仲現場之約，還有到老都要一起拍Reels，
還有還有要一起在相聚時分享彼此的近況、聊聊那未知的未來。

願未來的我們依然閃爍著各自的光芒，
在不同的路上前進，仍能在某個時刻再次相遇。
畢業快樂，尹榛。
`
  },
  wang: {
    name: "wang",
    questions: [
      {
        question: "哪間不是我們去政大考試發現的房子名稱",
        options: ["政大校長的家", "翡翠城堡", "神奇山莊", "金城舞都"],
        answer: "金城舞都",
      },
      {
        question: "我們最常聚餐點？",
        options: ["教室", "Ju屋處", "小米", "McDonald's"],
        answer: "小米",
      },
      {
        question: "上次說在路上看到很像你的人是穿什麼顏色的上衣",
        options: ["紅色", "藍色", "綠色", "黑色"],
        answer: "綠色",
      },
      {
        question: "哪間我們目前沒有一起吃過？",
        options: ["德式披薩", "京宴鍋物", "涓豆腐", "十二段"],
        answer: "十二段",
      },
      {
        question: "你最常說話提到的詞彙？",
        options: ["笑死", "真假", "當時候", "嗯"],
        answer: "當時候",
      },
    ],
    photos: wangPhotos,
    backgroundPhoto:
    "/images/wang/05.JPG",
    letter: `
嗨 王美美 ⋆͛♥︎⋆
很奇妙的淵源我們會認識並一起走過四年的時光，一切可能都來源於你那猖狂的笑聲吧！
四年裡，我們一起走過大大小小的困難，幾乎分組作業都一定會有你我，
可能是因為我也很依賴你吧(*ˇωˇ*)
總覺得有你跟我一起就可以克服掉那份困難，即使過程有時候我們也會有矛盾。

在升學之際，你我幾乎前後決定補習考試，我們從學校的戰友成為補習班的戰友，
過程真的是又有畢專，又有上課考試，可以說是焦頭爛額(ノ〠_〠)
但我真的發自內心佩服你的堅韌，你總是會很認真地去拚上課進度，即使你假日還有工作；
還有你雖然最後已經對資管考試缺乏熱忱，但你依然把每場任務都完成，
我只想說你是一位很認真也上進的人，真心地令我覺得讚美，希望你也可以對自己更有自信。

這次的回憶照片裡我特別選了幾張你笑得很開心的照片，希望你有認真看完！
我覺得那些鏡頭下的你，很自然好看，所以之後拍照的時候，要記得多燦笑哈哈哈。

很高興在大學裡有你的陪伴ʚʚ
未來的路也許會各自往不同方向走，但希望我們依然能保持聯絡，
也希望你在人生的路上，可以慢慢遇見更多屬於自己的風景與花朵，
然後在那些日子裡，被好好地照顧、也好好地成為自己，因為你足夠好。
畢業快樂，王美美。
`
  },
  su: {
    name: "su",
    questions: [
      {
        question: "我們緣分起源？",
        options: ["教室", "環服", "McDonald's", "圖書館"],
        answer: "環服",
      },
      {
        question: "哪堂課最好睡？",
        options: ["企業倫理", "實用英文", "自然科學與人工智慧", "資料庫管理"],
        answer: "自然科學與人工智慧",
      },
      {
        question: "我們最常聚餐點？",
        options: ["教室", "Ju屋處", "小米", "McDonald's"],
        answer: "小米",
      },
      {
        question: "哪杯不是我們一起喝過的飲料？",
        options: ["芋頭鮮奶", "決明大麥", "蘋果紅萱", "綠豆冰沙"],
        answer: "蘋果紅萱",
      },
      {
        question: "邊境是什麼狗？",
        options: ["臘腸", "金毛", "牧羊犬", "柯基"],
        answer: "牧羊犬",
      },
    ],
    photos: suPhotos,
    backgroundPhoto:
    "/images/su/18.JPG",
    letter: `
嗨 小蘇同學 ˗ˏˋ❤ˎˊ˗  
大學四年裡應該是妳我互相陪伴最久，我們不僅是同學還是鄰居，生活的大小事都有你。
我想很奇妙的緣分你我可以走這麼久，有時候覺得你我個性真的不同，
就像是我在緊張焦慮你總在旁邊chill，但有時候又想想，
我們能夠一起走過大學四年應該是有某部分契合的點吧！

我很喜歡日常下課一起跟你散步回家在路上看動物的時光；
也喜歡晚上揪你吃消夜、買紅豆湯、喝我們最愛的迷客夏；
但四年過了我們也到了要說分別的時候，
還有太多聊過的地方但都還沒來得及一起去，也還有許多店沒有一起探，
未來有空我們就相約一起實現吧！超期待跟你一起出國的(͡ ͡° ͜ つ ͡͡°)

未來的日子裡，即使生活變得忙碌、步調變快，或是老闆太機車，
我都希望小蘇還是那個「小蘇」，希望你一直是快樂的你。

畢業快樂，小蘇。
以後也要記得在不同的生活裡，偶爾相遇一下歐。
`
  },
  Kotomi: {
    name: "Kotomi",
    questions: [
      {
        question: "你去了哪個國家交換？",
        options: ["法國", "德國", "英國", "日本"],
        answer: "德國",
      },
      {
        question: "你腿曬黑那天穿的是什麼顏色的上衣？",
        options: ["藍白色", "白色", "透膚", "粉紅色"],
        answer: "白色",
      },
      {
        question: "你喜歡吃的店以及被Ju在那間店外遇見過？",
        options: ["御鼎牛排", "八哥重慶酸辣粉", "丸冰", "迷客夏"],
        answer: "八哥重慶酸辣粉",
      },
      {
        question: "你在澎湖花火節結束那天喝了什麼飲料？",
        options: ["鳳梨青茶", "凍齡不解釋", "藍莓果茶", "蘋果冰茶"],
        answer: "蘋果冰茶",
      },
      {
        question: "一起去看雙心石滬那天你帶的項鍊是什麼吊墜？",
        options: ["鑽石", "愛心", "蝴蝶結", "星星"],
        answer: "蝴蝶結",
      },
    ],
    photos: kPhotos,
    backgroundPhoto:
    "/images/k/18.JPG",
    letter: `
嗨 Kotomi ⸜♡⸝
很高興到大學的最後能跟你一直成為ともだち，
大學四年感覺我們接觸的時間說多好像也不多，大多時候都是因為分組才相聚，
啊！還有你去交換了～真正相處的時間又更少，
但我覺得還好畢業專題有跟你一起，也讓我們有了一起去畢業旅行的約定。

很開心一起去澎湖，回憶美好的讓我覺得好短暫而有點不捨(◞‸◟)
在澎湖因為成為你的摩托車司機，我們有了更多的接觸，我覺得很幸運，感覺跟你變得親近，
回來後一起玩setlog，還有大家聚在我家吃飯，這些都是最後留下很美好的回憶。
我真心的期待未來我們還能夠一起出去玩，再見面，再一起哈哈大笑。

那天聽到你說到6月底要回日本，哇真的突然覺得難過捨不得的感覺！
真的覺得好像才更熟悉就要道別了，
我會好好記住這些在一起的回憶，並慢慢地期待下次見面。

一直覺得 Kotomi 是一個很願意體驗生活、也把日子過得很溫柔的人，
希望回到日本工作之後，你依然可以保持這樣對生活的熱忱與好奇心，
在新的城市、新的節奏裡，也能找到屬於你的快樂與安定。

最後想說：
これからもずっと元気で、幸せにね。
そして、また会える日を楽しみにしています。
卒業おめでとう Kotomi。
`
  },
  Nathania: { 
    name: "Nathania",
    questions: [
      {
        question: "澎湖玩水當天換鞋你選了什麼顏色的鞋子？",
        options: ["黑色", "深藍色", "黃色", "粉紅色"],
        answer: "黃色",
      },
      {
        question: "那天一起吃路邊烤肉聚餐地點在哪？",
        options: ["路邊烤肉的店", "蘇的家", "Ju屋處", "Kotomi的家"],
        answer: "Ju屋處",
      },
      {
        question: "你帶來聚餐的小菜裡面沒有什麼蔬菜？",
        options: ["小黃瓜", "苦瓜", "玉米筍", "地瓜葉"],
        answer: "地瓜葉",
      },
      {
        question: "第一天在澎湖吃的冰沒有哪個顏色？",
        options: ["紅色", "綠色", "黑色", "黃色"],
        answer: "黑色",
      },
      {
        question: "你妹妹來台灣讀什麼科系？",
        options: ["資訊管理", "資訊工程", "智慧資訊", "資訊分析"],
        answer: "資訊工程",
      },
    ],
    photos: naPhotos,
    backgroundPhoto:
    "/images/na/29.JPG",
    letter: `
嗨 秀玉♡°ஂ 
大學的四年裡與你的認識不能算是很多，但感覺都很好笑ヽ(✿ﾟ▽ﾟ)ノ
就像是我突然某個早上決定出門跑步竟然能夠遇見你；
還有畢業專題同組最後也莫名地採用你的idea，我們大家就默默地經歷一段在超市調查日子，
是很有趣的經過，跟你本人一樣也是個有趣的人。

很開心這次有機會一起去澎湖玩，不論是一起走走晃晃拍畢業照，還是一起去吃各種美食，
又或是一起去划很累的獨木舟，過程都令我難忘，也覺得可以有更多的相處很難得，
這次照片回憶裡放了我們一起的合照，
很開心那天在冰店你提議拍照，因此有了我們一起的回憶照片，
這趟旅行發現秀玉很喜歡拍照，希望之後有更多機會可以一起出去玩一起拍拍美麗的照片。

在我們相處的過程中，有時候總覺得你是一個很忙的人，
但在更多了解下，我想你應該是一位很認真生活的人吧！
在有限的時間裡，做了最多的事情，
秀玉真的是一位很優秀的人，是位很值得學習的對象。

希望畢業後，你依然能夠保持有時候ㄎㄧㄤ的可愛，
還有保持一直健康的自律生活，要多出門跑步歐，搞不好會遇到我( • ̀ω•́ )
未來期許我們都能夠更加燦爛，在台灣時有機會出來小聚，
也希望有機會能夠去到你生活的地方了解你的文化～
畢業快樂，秀玉。
`
  }
};